using System;

namespace ConsoleApp4
{
    class Program
    {
        static void Main()
        {
            //За да намерим в кой квадрант се намира точката, първо трябва да въведем координати х и у;
            Console.Write("x = "); //Изписваме "х = " в конзолата;
            sbyte x = SByte.Parse(Console.ReadLine()); //Декларираме променлива от знаков целочислен тип sbyte с идентификатор "x", стойността на променливата се чете от конзолата индиректно чрез парсване.
            //Правим същото за координатата у;
            Console.Write("y = ");
            sbyte y = SByte.Parse(Console.ReadLine());
            //След като сме въвели координатите на точката (х, у), трябва да проверим дали тя се намира във втори квадрант.
            //Една точка се намира във втори квадрант, когато у е положително число, а х отрицателно.
            if (x < 0 && y > 0) //правим проверка със условния оператор "if" дали х < 0 (дали е отрицателно число) и дали у > 0 (положително); Ако условието е изпълнено, ще се изпълни тялото на условната конструкция, което се намира във фигурните скоби.
            {
                //Тяло на условната конструкция
                Console.WriteLine("Точката се намира във втори квадрант."); 
            }
            else //Ако условието х да е отрицателно, а у - положително число не е изпълнено, във всички останали случаи ще се изпълни кодът в тялото на else конструкцията. 
            {
                //Тяло на else конструкцията.
                Console.WriteLine("Точката НЕ се намира във втори квадрант.");
            }
        }
    }
}
