using System;

namespace ConsoleApp4
{
    class Program
    {
        static void Main()
        {
            //Кратно се нарича цяло число, което се дели на друго число без остатък. Числото х е кратно на 3 ако остатъкът от делението на х със 3 е равен на 0.
            //За целта използваме аритметичният операторът "%", който връща остатъкът от деленето на две числа.
            Console.Write("x = "); //Изписваме "х = " в конзолата;
            short x = Int16.Parse(Console.ReadLine()); //Декларираме променлива от знаков целочислен тип short с идентификатор "x", стойността на променливата се чете от конзолата индиректно чрез парсване.
            //Int16.Parse() е същото като short.Parse(), и двете ще работят и е въпрос на лично предпочитание. Аз изписвам Int16, защото е прието да се използват пълните имена на класовете за извиквания на статични методи. Това подчертава факта, че те всъщност са класове, които съдържат части от код вместо възможно най-простите (примитивни) данни, които псевдонимите предполагат.
            //Int16 означава класа за 16 битова знакова целочислена променлива.
            if (x % 3 == 0) //Ако остатъкът от деленето на числото х със 3 е равен на 0, то числото е кратно на 3.
            {
                Console.WriteLine("Числото е кратно на 3.");
            }
            else //В противен случай числото не е кратно на 3.
            {
                Console.WriteLine("Числото НЕ е кратно на 3.");
            }
        }
    }
}
