using System;

namespace ConsoleApp5
{
    class Program
    {
        static void Main(string[] args)
        {
            //Решението е подобно на предишната задача, но в случая проверяваме дали числото е кратно на две числа - 5 и 2
            Console.Write("x = ");
            short x = Int16.Parse(Console.ReadLine());
            if(x % 5 == 0 && x % 2 != 0) //Ако остатъкът от делението на х с 5 е 0 И ако остатъкът от деленето на х с 2 е различен от 0 ще се изпълни тялото на условната конструкция. Използваме логическият оператор && (И) за да проверим дали и двете условия са равни. (Пише се "&&", защото & е побитов оператор, а && е логически оператор, който се прилага към булеви операнди. Операторът & проверява всеки операнд, а && проверява само първия операнд.).
            {
                Console.WriteLine("Числото е кратно на 5 и не е кратно на 2.");
            }
            else
            {
                Console.WriteLine("Условието не е изпълнено.");
            }
        }
    }
}
