using System;

namespace ConsoleApp6
{
    class Program
    {
        static void Main(string[] args)
        {
            Console.Write("Час 1 = ");//Изписваме "Час 1 = "
            byte hourOne = Byte.Parse(Console.ReadLine()); //Декларираме променлива от целочислен БЕЗзнаков тип byte и я инициализираме със стойност въведена от клавиатурата чрез парсване.
            //Тази променлива е за часовете във първото време. След като въведем часовете, въвеждаме и минутите.
            Console.Write("Минути 1 = ");
            byte minOne = Byte.Parse(Console.ReadLine()); //Декларираме втора променлива за минутите от първия час.
            //Повтаряме същото за втория час.
            Console.Write("Час 2 = ");
            byte hourTwo = Byte.Parse(Console.ReadLine());
            Console.Write("Минути 2 = ");
            byte minTwo = Byte.Parse(Console.ReadLine());

           
            if (hourOne > 24 || hourTwo > 24 || minOne > 60 || minTwo > 60) //След като сме въвели стойностите проверяваме дали всички от тях са правилни. Не може да има повече от 24 часа в 1 ден или повече от 60 минути в 1 час. За целта използваме логическият оператор || (ИЛИ).
            {
                Console.WriteLine("Допуснали сте грешка при въвеждането."); //Ако горното условие е изпълнено, т.е например сме въвели 63:00 часа, няма да се изпълни програмата
            }
            else //Ако въведените данни НЕ са грешни ще се изпълни програмата.
            {
                Console.WriteLine(hourOne + ":" + minOne);//Отпечатваме двата въведени часа.
                Console.WriteLine(hourTwo + ":" + minTwo);
                Console.WriteLine("Разлика(в минути) = " + ( Math.Abs(hourOne - hourTwo) * 60  + Math.Abs(minOne - minTwo)) ); //За разликата използваме Math.Abs(), това връща абсолютната стойност (модула) от разликата на числата.
                                                                                                                              //Разликата от часовете я умножаваме по 60, за да превърнем получената разлика от часове в минути, защото има 60 минути в един час и към това добавяме разликата от минутите.
            }
        }
    }
}
